Islam-ElShahaby/STM32-G29/src/telemetry.c
#include "telemetry.h"

#include "mcp2515.h"
#include "powertrain.h"
#include "shifter.h"
#include "led_fault.h"
#include "adc.h"

#include "stm32f4xx_hal.h"

#include <stdbool.h>
#include <stdint.h>


/* ========================================================================= */
/* CAN IDs                                                                   */
/* ========================================================================= */

#define CAN_TELEMETRY_ID       0x0A2U
#define CAN_LIGHTS_ID          0x0A3U


/* ========================================================================= */
/* G29 BUTTON MASKS                                                          */
/* ========================================================================= */

#define BTN_HIGH_BEAM          0x00000400U
#define BTN_LOW_BEAM           0x00000800U

#define BTN_LEFT_INDICATOR     0x00000080U
#define BTN_RIGHT_INDICATOR    0x00000040U

#define BTN_X                  0x00000001U


/* ========================================================================= */
/* LIGHT STATE BIT POSITIONS                                                 */
/* ========================================================================= */

/*
 * CAN 0x0A3 Byte 1
 *
 * Bit 0 = High beam
 * Bit 1 = Low beam
 * Bit 2 = Left indicator
 * Bit 3 = Right indicator
 */

#define LIGHTS_BIT_HIGH_BEAM        0U
#define LIGHTS_BIT_LOW_BEAM         1U
#define LIGHTS_BIT_LEFT_INDICATOR   2U
#define LIGHTS_BIT_RIGHT_INDICATOR  3U


/* ========================================================================= */
/* INDICATOR BLINK                                                           */
/* ========================================================================= */

#define INDICATOR_BLINK_PERIOD_MS   500U


/* ========================================================================= */
/* PHYSICAL LED GPIO                                                         */
/* ========================================================================= */

/*
 * IMPORTANT:
 *
 * PA6 is used by the ADC for servo feedback.
 *
 * Therefore PA6 MUST NOT be used as a light output.
 *
 * Light outputs:
 *
 * Left indicator  -> PB2
 * Right indicator -> PB7
 * Low beam        -> PA7
 * High beam       -> PA8
 */

#define LEFT_LED_PORT       GPIOB
#define LEFT_LED_PIN        GPIO_PIN_2

#define RIGHT_LED_PORT      GPIOB
#define RIGHT_LED_PIN       GPIO_PIN_7

#define LOW_LED_PORT        GPIOA
#define LOW_LED_PIN         GPIO_PIN_7

#define HIGH_LED_PORT       GPIOA
#define HIGH_LED_PIN        GPIO_PIN_8


/* ========================================================================= */
/* CAN TRANSMISSION PERIOD                                                   */
/* ========================================================================= */

#define LIGHTS_TX_PERIOD_MS       10U
#define TELEMETRY_TX_PERIOD_MS    10U


/* ========================================================================= */
/* 0x0A2 POWERTRAIN TELEMETRY                                                */
/* ========================================================================= */

/*
 * CAN ID: 0x0A2
 * DLC:    8
 *
 * Byte 1 -> data[0] : Engine RPM LOW
 * Byte 2 -> data[1] : Engine RPM HIGH
 * Byte 3 -> data[2] : Vehicle speed
 * Byte 4 -> data[3] : Gear mode
 *                       'P' / 'N' / 'D' / 'R'
 * Byte 5 -> data[4] : Gear number
 * Byte 6 -> data[5] : Hands-on flag
 * Byte 7 -> data[6] : Reserved
 * Byte 8 -> data[7] : Rolling counter
 */

static void send_telemetry_can_msg(
    uint8_t speed,
    uint16_t rpm,
    int8_t gear,
    char gear_mode,
    bool hands_on
)
{
    static uint8_t msg_counter = 0U;

    struct can_frame frame = {0};


    frame.id = CAN_TELEMETRY_ID;
    frame.dlc = 8U;


    /* --------------------------------------------------------------------- */
    /* Byte 1-2: RPM                                                         */
    /* --------------------------------------------------------------------- */

    frame.data[0] =
        (uint8_t)(rpm & 0xFFU);

    frame.data[1] =
        (uint8_t)((rpm >> 8) & 0xFFU);


    /* --------------------------------------------------------------------- */
    /* Byte 3: Speed                                                         */
    /* --------------------------------------------------------------------- */

    frame.data[2] =
        speed;


    /* --------------------------------------------------------------------- */
    /* Byte 4: Gear mode                                                     */
    /* --------------------------------------------------------------------- */

    frame.data[3] =
        (uint8_t)gear_mode;


    /* --------------------------------------------------------------------- */
    /* Byte 5: Gear number                                                   */
    /* --------------------------------------------------------------------- */

    frame.data[4] =
        (uint8_t)gear;


    /* --------------------------------------------------------------------- */
    /* Byte 6: Hands-on                                                      */
    /* --------------------------------------------------------------------- */

    frame.data[5] =
        hands_on ? 1U : 0U;


    /* --------------------------------------------------------------------- */
    /* Byte 7: Reserved                                                      */
    /* --------------------------------------------------------------------- */

    frame.data[6] =
        0x00U;


    /* --------------------------------------------------------------------- */
    /* Byte 8: Rolling counter                                               */
    /* --------------------------------------------------------------------- */

    frame.data[7] =
        msg_counter++;


    /* --------------------------------------------------------------------- */
    /* Send                                                                  */
    /* --------------------------------------------------------------------- */

    (void)mcp2515_send(&frame);
}


