Islam-ElShahaby/STM32-G29/src/telemetry.c
/* ========================================================================= */
/* 0x0A3 LIGHTS / FAULT / FUEL / TEMPERATURE / SERVO ANGLE                   */
/* ========================================================================= */

/*
 * CAN ID: 0x0A3
 * DLC:    7
 *
 * Byte 1:
 *
 *     Bit 0 = High beam
 *     Bit 1 = Low beam
 *     Bit 2 = Left indicator
 *     Bit 3 = Right indicator
 *
 *
 * Byte 2:
 *
 *     Bits 1:0 = Left indicator fault
 *     Bits 3:2 = Right indicator fault
 *     Bits 5:4 = Low beam fault
 *     Bits 7:6 = High beam fault
 *
 *
 * Fault encoding:
 *
 *     00 = OK
 *     01 = OPEN
 *     10 = SHORT
 *
 *
 * Byte 3 = X button
 * Byte 4 = Fuel              0..100 %
 * Byte 5 = Temperature       0..100 %
 * Byte 6 = Servo angle       0..180 degrees
 * Byte 7 = Rolling counter
 *
 *
 * Servo feedback:
 *
 *     PA6
 *     ADC_CHANNEL_6
 *
 * Raw ADC range:
 *
 *     0    -> approximately 0 V
 *     4095 -> approximately 3.3 V
 *
 *
 * Servo angle conversion:
 *
 *     angle = ADC * 180 / 4095
 *
 *
 * Examples:
 *
 *     ADC = 0       -> 0°
 *     ADC = 2047    -> approximately 90°
 *     ADC = 4095    -> 180°
 */

static void send_lights_can_msg(
    uint8_t lights_state,
    uint8_t fault_state,
    bool x_pressed,
    uint8_t fuel,
    uint8_t temperature,
    uint8_t servo_angle
)
{
    static uint8_t msg_counter = 0U;

    struct can_frame frame = {0};


    frame.id = CAN_LIGHTS_ID;

    /*
     * We use 7 CAN bytes.
     */
    frame.dlc = 7U;


    /* --------------------------------------------------------------------- */
    /* Byte 1: Light states                                                  */
    /* --------------------------------------------------------------------- */

    frame.data[0] =
        lights_state;


    /* --------------------------------------------------------------------- */
    /* Byte 2: LED fault states                                              */
    /* --------------------------------------------------------------------- */

    frame.data[1] =
        fault_state;


    /* --------------------------------------------------------------------- */
    /* Byte 3: X button                                                      */
    /* --------------------------------------------------------------------- */

    frame.data[2] =
        x_pressed ? 1U : 0U;


    /* --------------------------------------------------------------------- */
    /* Byte 4: Fuel 0..100                                                   */
    /* --------------------------------------------------------------------- */

    frame.data[3] =
        (fuel > 100U)
        ? 100U
        : fuel;


    /* --------------------------------------------------------------------- */
    /* Byte 5: Temperature 0..100                                            */
    /* --------------------------------------------------------------------- */

    frame.data[4] =
        (temperature > 100U)
        ? 100U
        : temperature;


    /* --------------------------------------------------------------------- */
    /* Byte 6: Servo angle 0..180                                            */
    /* --------------------------------------------------------------------- */

    frame.data[5] =
        servo_angle;


    /* --------------------------------------------------------------------- */
    /* Byte 7: Rolling counter                                               */
    /* --------------------------------------------------------------------- */

    frame.data[6] =
        msg_counter++;


    /* --------------------------------------------------------------------- */
    /* Send                                                                  */
    /* --------------------------------------------------------------------- */

    (void)mcp2515_send(&frame);
}


/* ========================================================================= */
/* BUTTON EDGE DETECTION                                                     */
/* ========================================================================= */

static void toggle_on_press(
    uint32_t buttons,
    uint32_t mask,
    bool *was_pressed,
    bool *state
)
{
    bool pressed =
        ((buttons & mask) != 0U);


    /*
     * Toggle only on rising edge.
     */

    if (
        pressed &&
        !(*was_pressed)
    ) {

        *state =
            !(*state);
    }


    *was_pressed =
        pressed;
}


/* ========================================================================= */
/* LIGHT TOGGLE STATE                                                        */
/* ========================================================================= */

uint8_t lights_toggle_update(
    uint32_t buttons,
    bool *left_on,
    bool *right_on,
    bool *low_on,
    bool *high_on
)
{
    static bool high_beam = false;
    static bool low_beam = false;

    static bool left_indicator = false;
    static bool right_indicator = false;


    static bool high_beam_pressed = false;
    static bool low_beam_pressed = false;

    static bool left_indicator_pressed = false;
    static bool right_indicator_pressed = false;


    /* --------------------------------------------------------------------- */
    /* High beam                                                             */
    /* --------------------------------------------------------------------- */

    toggle_on_press(
        buttons,
        BTN_HIGH_BEAM,
        &high_beam_pressed,
        &high_beam
    );


    /* --------------------------------------------------------------------- */
    /* Low beam                                                              */
    /* --------------------------------------------------------------------- */

    toggle_on_press(
        buttons,
        BTN_LOW_BEAM,
        &low_beam_pressed,
        &low_beam
    );


    /* --------------------------------------------------------------------- */
    /* Left indicator                                                        */
    /* --------------------------------------------------------------------- */

    toggle_on_press(
        buttons,
        BTN_LEFT_INDICATOR,
        &left_indicator_pressed,
        &left_indicator
    );


    /* --------------------------------------------------------------------- */
    /* Right indicator                                                       */
    /* --------------------------------------------------------------------- */

    toggle_on_press(
        buttons,
        BTN_RIGHT_INDICATOR,
        &right_indicator_pressed,
        &right_indicator
    );


    /* --------------------------------------------------------------------- */
    /* Return logical states                                                 */
    /* --------------------------------------------------------------------- */

    if (left_on != NULL) {
        *left_on =
            left_indicator;
    }

    if (right_on != NULL) {
        *right_on =
            right_indicator;
    }

    if (low_on != NULL) {
        *low_on =
            low_beam;
    }

