Islam-ElShahaby/STM32-G29/src/telemetry.c
    if (high_on != NULL) {
        *high_on =
            high_beam;
    }


    /* --------------------------------------------------------------------- */
    /* Pack CAN Byte 1                                                       */
    /* --------------------------------------------------------------------- */

    return (uint8_t)(
        (high_beam ?
            (1U << LIGHTS_BIT_HIGH_BEAM) : 0U) |

        (low_beam ?
            (1U << LIGHTS_BIT_LOW_BEAM) : 0U) |

        (left_indicator ?
            (1U << LIGHTS_BIT_LEFT_INDICATOR) : 0U) |

        (right_indicator ?
            (1U << LIGHTS_BIT_RIGHT_INDICATOR) : 0U)
    );
}


/* ========================================================================= */
/* CAN LIGHTS UPDATE                                                         */
/* ========================================================================= */

void can_lights_update(
    uint8_t lights_state,
    uint8_t fault_state,
    uint32_t buttons,
    uint8_t fuel,
    uint8_t temperature
)
{
    static uint32_t last_tx_time = 0U;

    static uint8_t prev_lights_state = 0xFFU;
    static uint8_t prev_fault_state = 0xFFU;

    static uint8_t prev_fuel = 0xFFU;
    static uint8_t prev_temperature = 0xFFU;

    static uint8_t prev_servo_angle = 0xFFU;

    static bool prev_x_pressed = false;


    uint32_t now =
        HAL_GetTick();


    bool x_pressed =
        ((buttons & BTN_X) != 0U);


    /* --------------------------------------------------------------------- */
    /* Read servo feedback from PA6                                          */
    /* --------------------------------------------------------------------- */

uint8_t servo_angle =
    adc_get_servo_angle();


    /* --------------------------------------------------------------------- */
    /* Clamp fuel                                                            */
    /* --------------------------------------------------------------------- */

    if (fuel > 100U) {
        fuel = 100U;
    }


    /* --------------------------------------------------------------------- */
    /* Clamp temperature                                                     */
    /* --------------------------------------------------------------------- */

    if (temperature > 100U) {
        temperature = 100U;
    }


    /* --------------------------------------------------------------------- */
    /*
     * Transmit:
     *
     * 1. Every 10 ms
     *
     * OR
     *
     * 2. Light state changed
     *
     * OR
     *
     * 3. Fault state changed
     *
     * OR
     *
     * 4. X changed
     *
     * OR
     *
     * 5. Fuel changed
     *
     * OR
     *
     * 6. Temperature changed
     *
     * OR
     *
     * 7. Servo angle changed
     */
    /* --------------------------------------------------------------------- */

    if (
        (now - last_tx_time >=
         LIGHTS_TX_PERIOD_MS)

        ||

        (lights_state !=
         prev_lights_state)

        ||

        (fault_state !=
         prev_fault_state)

        ||

        (x_pressed !=
         prev_x_pressed)

        ||

        (fuel !=
         prev_fuel)

        ||

        (temperature !=
         prev_temperature)

        ||

        (servo_angle !=
         prev_servo_angle)
    ) {

        send_lights_can_msg(
            lights_state,
            fault_state,
            x_pressed,
            fuel,
            temperature,
            servo_angle
        );


        last_tx_time =
            now;


        prev_lights_state =
            lights_state;

        prev_fault_state =
            fault_state;

        prev_x_pressed =
            x_pressed;

        prev_fuel =
            fuel;

        prev_temperature =
            temperature;

        prev_servo_angle =
            servo_angle;
    }
}


/* ========================================================================= */
/* LIGHT GPIO INITIALIZATION                                                 */
/* ========================================================================= */

void lights_gpio_init(void)
{
    GPIO_InitTypeDef g = {0};


    /* --------------------------------------------------------------------- */
    /* Enable GPIO clocks                                                    */
    /* --------------------------------------------------------------------- */

    __HAL_RCC_GPIOA_CLK_ENABLE();
    __HAL_RCC_GPIOB_CLK_ENABLE();


    /* --------------------------------------------------------------------- */
    /* Initial outputs LOW                                                   */
    /* --------------------------------------------------------------------- */

    /* Left indicator -> PB2 */
    HAL_GPIO_WritePin(
        LEFT_LED_PORT,
        LEFT_LED_PIN,
        GPIO_PIN_RESET
    );


    /* Right indicator -> PB7 */
    HAL_GPIO_WritePin(
        RIGHT_LED_PORT,
        RIGHT_LED_PIN,
        GPIO_PIN_RESET
    );


    /* Low beam -> PA7 */
    /* High beam -> PA8 */

    HAL_GPIO_WritePin(
        GPIOA,
        LOW_LED_PIN |
        HIGH_LED_PIN,
        GPIO_PIN_RESET
    );


    /* --------------------------------------------------------------------- */
    /* PB2 - Left indicator                                                  */
    /* PB7 - Right indicator                                                 */
    /* --------------------------------------------------------------------- */

    g.Pin =
        LEFT_LED_PIN |
        RIGHT_LED_PIN;

    g.Mode =
        GPIO_MODE_OUTPUT_PP;

    g.Pull =
        GPIO_NOPULL;

    g.Speed =
        GPIO_SPEED_FREQ_LOW;


    HAL_GPIO_Init(
        GPIOB,
        &g
    );


    /* --------------------------------------------------------------------- */
    /* PA7 - Low beam                                                        */
    /* PA8 - High beam                                                       */
    /* --------------------------------------------------------------------- */

