Islam-ElShahaby/STM32-G29/src/telemetry.c
    g.Pin =
        LOW_LED_PIN |
        HIGH_LED_PIN;


    HAL_GPIO_Init(
        GPIOA,
        &g
    );
}


/* ========================================================================= */
/* LIGHT GPIO OUTPUT                                                         */
/* ========================================================================= */

void lights_gpio_set(
    bool left_on,
    bool right_on,
    bool low_on,
    bool high_on,
    bool *left_out,
    bool *right_out,
    bool *low_out,
    bool *high_out
)
{
    uint32_t now =
        HAL_GetTick();


    /*
     * Indicator blink.
     */

    bool blink_phase =
        ((now / INDICATOR_BLINK_PERIOD_MS) % 2U)
        == 0U;


    bool left_output =
        left_on && blink_phase;


    bool right_output =
        right_on && blink_phase;


    /* --------------------------------------------------------------------- */
    /* Left indicator -> PB2                                                 */
    /* --------------------------------------------------------------------- */

    HAL_GPIO_WritePin(
        LEFT_LED_PORT,
        LEFT_LED_PIN,
        left_output ?
            GPIO_PIN_SET :
            GPIO_PIN_RESET
    );


    /* --------------------------------------------------------------------- */
    /* Right indicator -> PB7                                                */
    /* --------------------------------------------------------------------- */

    HAL_GPIO_WritePin(
        RIGHT_LED_PORT,
        RIGHT_LED_PIN,
        right_output ?
            GPIO_PIN_SET :
            GPIO_PIN_RESET
    );


    /* --------------------------------------------------------------------- */
    /* Low beam -> PA7                                                       */
    /* --------------------------------------------------------------------- */

    HAL_GPIO_WritePin(
        LOW_LED_PORT,
        LOW_LED_PIN,
        low_on ?
            GPIO_PIN_SET :
            GPIO_PIN_RESET
    );


    /* --------------------------------------------------------------------- */
    /* High beam -> PA8                                                      */
    /* --------------------------------------------------------------------- */

    HAL_GPIO_WritePin(
        HIGH_LED_PORT,
        HIGH_LED_PIN,
        high_on ?
            GPIO_PIN_SET :
            GPIO_PIN_RESET
    );


    /* --------------------------------------------------------------------- */
    /* Return actual physical states                                         */
    /* --------------------------------------------------------------------- */

    if (left_out != NULL) {
        *left_out =
            left_output;
    }

    if (right_out != NULL) {
        *right_out =
            right_output;
    }

    if (low_out != NULL) {
        *low_out =
            low_on;
    }

    if (high_out != NULL) {
        *high_out =
            high_on;
    }
}


/* ========================================================================= */
/* POWERTRAIN TELEMETRY                                                      */
/* ========================================================================= */

void can_telemetry_update(
    enum shifter_mode shifter_sel,
    bool hands_on
)
{
    static uint32_t last_tx_time = 0U;

    static bool prev_hands_on = false;


    uint32_t now =
        HAL_GetTick();


    struct powertrain_state pt;


    /* --------------------------------------------------------------------- */
    /* Get current powertrain state                                          */
    /* --------------------------------------------------------------------- */

    powertrain_get_state(
        &pt
    );


    /* --------------------------------------------------------------------- */
    /* Speed                                                                  */
    /* --------------------------------------------------------------------- */

    uint8_t speed =
        (pt.speed_kmh > 255U)
        ? 255U
        : (uint8_t)pt.speed_kmh;


    /* --------------------------------------------------------------------- */
    /* RPM                                                                    */
    /* --------------------------------------------------------------------- */

    uint16_t rpm =
        pt.engine_rpm;


    /* --------------------------------------------------------------------- */
    /* Gear number                                                            */
    /* --------------------------------------------------------------------- */

    int8_t gear =
        pt.gear;


    /* --------------------------------------------------------------------- */
    /* Gear mode                                                              */
    /* --------------------------------------------------------------------- */

    char gear_mode;


    if (
        shifter_sel == SHIFTER_N ||
        shifter_sel == SHIFTER_P
    ) {

        gear_mode =
            shifter_letter(
                shifter_sel
            );
    }

    else {

        gear_mode =
            pt.reverse
            ? 'R'
            : 'D';
    }


    /* --------------------------------------------------------------------- */
    /* Hands-on change                                                        */
    /* --------------------------------------------------------------------- */

    bool hod_changed =
        (hands_on != prev_hands_on);


    /* --------------------------------------------------------------------- */
    /* Periodic / event transmission                                          */
    /* --------------------------------------------------------------------- */

    if (
        (now - last_tx_time >=
         TELEMETRY_TX_PERIOD_MS)

        ||

        hod_changed
    ) {

        send_telemetry_can_msg(
            speed,
            rpm,
            gear,
            gear_mode,
            hands_on
        );


        last_tx_time =
            now;


        prev_hands_on =
            hands_on;
    }
}


