Islam-ElShahaby/STM32-G29/src/telemetry.c
/* ========================================================================= */
/* LED FAULT -> CAN ENCODING                                                 */
/* ========================================================================= */

/*
 * Encoding:
 *
 *     LED_OK    = 00
 *     LED_OPEN  = 01
 *     LED_SHORT = 10
 */

static uint8_t led_fault_to_bits(
    led_fault_state_t state
)
{
    switch (state) {

    case LED_OPEN:
        return 1U;

    case LED_SHORT:
        return 2U;

    case LED_OK:
    default:
        return 0U;
    }
}


/* ========================================================================= */
/* GET COMBINED LED FAULT STATE                                              */
/* ========================================================================= */

/*
 * Byte 2 layout:
 *
 * Bits 1:0 = LED 0 = Left indicator
 * Bits 3:2 = LED 1 = Right indicator
 * Bits 5:4 = LED 2 = Low beam
 * Bits 7:6 = LED 3 = High beam
 */

uint8_t get_led_fault_state(void)
{
    uint8_t state =
        0U;


    /* --------------------------------------------------------------------- */
    /* LED 0 - Left indicator                                                */
    /* --------------------------------------------------------------------- */

    state |=
        (uint8_t)(
            led_fault_to_bits(
                led_fault_get(0)
            )
            << 0
        );


    /* --------------------------------------------------------------------- */
    /* LED 1 - Right indicator                                               */
    /* --------------------------------------------------------------------- */

    state |=
        (uint8_t)(
            led_fault_to_bits(
                led_fault_get(1)
            )
            << 2
        );


    /* --------------------------------------------------------------------- */
    /* LED 2 - Low beam                                                      */
    /* --------------------------------------------------------------------- */

    state |=
        (uint8_t)(
            led_fault_to_bits(
                led_fault_get(2)
            )
            << 4
        );


    /* --------------------------------------------------------------------- */
    /* LED 3 - High beam                                                     */
    /* --------------------------------------------------------------------- */

    state |=
        (uint8_t)(
            led_fault_to_bits(
                led_fault_get(3)
            )
            << 6
        );


    return state;
}